jankaluza/qsimkit/CPU/Variants/msp430x54xx.cpp
#ifndef TA1CCTL0_
#define TA1CCTL0_ 0x0382
#endif
#ifndef MPY_
#define MPY_ __MSP430_MPY32_BASE__ + 0x00
#endif
#ifndef TA1CCTL1_
#define TA1CCTL1_ 0x0384
#endif
#ifndef TA1EX0_
#define TA1EX0_ 0x03A0
#endif
#ifndef TA1CCTL2_
#define TA1CCTL2_ 0x0386
#endif
#ifndef TIMER0_B1_VECTOR
#define TIMER0_B1_VECTOR 0x76
#endif
#ifndef MC_UPDOWN
#define MC_UPDOWN MC_3
#endif
#ifndef __FLT_MIN__
#define __FLT_MIN__ 1.17549435e-38F
#endif
#ifndef UCB0IFG_
#define UCB0IFG_ 0x05FD
#endif
#ifndef P1IES_
#define P1IES_ __MSP430_PORT1_BASE__ + 0x18
#endif
#ifndef __ASSEMBLER__
#define __ASSEMBLER__ 1
#endif
#ifndef __CHAR_BIT__
#define __CHAR_BIT__ 8
#endif
#ifndef PJDS_
#define PJDS_ __MSP430_PORTJ_BASE__ + 0x08
#endif
#ifndef SYSBSLC_H_
#define SYSBSLC_H_ __MSP430_SYS_BASE__ + 0x03
#endif
#ifndef P5DIR_
#define P5DIR_ __MSP430_PORT5_BASE__ + 0x04
#endif
#ifndef TA1IV_H_
#define TA1IV_H_ 0x03AF
#endif
#ifndef __MSP430_PORT3_BASE__
#define __MSP430_PORT3_BASE__ 0x220
#endif
#ifndef P8OUT_
#define P8OUT_ __MSP430_PORT8_BASE__ + 0x03
#endif
#ifndef __WINT_MAX__
#define __WINT_MAX__ 65535U
#endif
#ifndef TA0R_
#define TA0R_ 0x0350
#endif
#ifndef UCSCTL8_H_
#define UCSCTL8_H_ 0x0171
#endif
#ifndef P11REN_
#define P11REN_ __MSP430_PORT11_BASE__ + 0x06
#endif
#ifndef SYSBSLC_L_
#define SYSBSLC_L_ __MSP430_SYS_BASE__ + 0x02
#endif
#ifndef P8SEL_
#define P8SEL_ __MSP430_PORT8_BASE__ + 0x0B
#endif
#ifndef __SIZE_MAX__
#define __SIZE_MAX__ 65535U
#endif
#ifndef __WCHAR_MAX__
#define __WCHAR_MAX__ 32767
#endif
#ifndef UCA0IV_
#define UCA0IV_ 0x05DE
#endif
#ifndef MC0
#define MC0 0x0010
#endif
#ifndef __FLT_EVAL_METHOD__
#define __FLT_EVAL_METHOD__ 0
#endif
#ifndef RES0_
#define RES0_ __MSP430_MPY32_BASE__ + 0x24
#endif
#ifndef P3REN_
#define P3REN_ __MSP430_PORT3_BASE__ + 0x06
#endif
#ifndef RTC_A_VECTOR
#define RTC_A_VECTOR 0x52
#endif
#ifndef RES1_
#define RES1_ __MSP430_MPY32_BASE__ + 0x26
#endif
#ifndef TA0EX0_
#define TA0EX0_ 0x0360
#endif
#ifndef RES2_
#define RES2_ __MSP430_MPY32_BASE__ + 0x28
#endif
#ifndef CM_BOTH
#define CM_BOTH CM_3
#endif
#ifndef __MSP430_HAS_T0A5__
#define __MSP430_HAS_T0A5__ 
#endif
#ifndef USCIA0_RXTX_VECTOR
#define USCIA0_RXTX_VECTOR 0x72
#endif
#ifndef RES3_
#define RES3_ __MSP430_MPY32_BASE__ + 0x2A
#endif
#ifndef UCSCTL8_L_
#define UCSCTL8_L_ 0x0170
#endif
#ifndef UCSSEL_UCLKI
#define UCSSEL_UCLKI UCSSEL_0
#endif
#ifndef __FINITE_MATH_ONLY__
#define __FINITE_MATH_ONLY__ 0
#endif
#ifndef __GNUC_PATCHLEVEL__
#define __GNUC_PATCHLEVEL__ 3
#endif
#ifndef SYSJMBC_H_
#define SYSJMBC_H_ __MSP430_SYS_BASE__ + 0x07
#endif
#ifndef SYSARB_H_
#define SYSARB_H_ __MSP430_SYS_BASE__ + 0x05
#endif
#ifndef TA1EX0_H_
#define TA1EX0_H_ 0x03A1
#endif
#ifndef RESHI_
#define RESHI_ __MSP430_MPY32_BASE__ + 0x0C
#endif
#ifndef P1DS_
#define P1DS_ __MSP430_PORT1_BASE__ + 0x08
#endif
#ifndef P4DIR_
#define P4DIR_ __MSP430_PORT4_BASE__ + 0x05
#endif
#ifndef __DEC64_MAX_EXP__
#define __DEC64_MAX_EXP__ 385
#endif
#ifndef P7OUT_
#define P7OUT_ __MSP430_PORT7_BASE__ + 0x02
#endif
#ifndef SYSJMBC_L_
#define SYSJMBC_L_ __MSP430_SYS_BASE__ + 0x06
#endif
#ifndef SYSARB_L_
#define SYSARB_L_ __MSP430_SYS_BASE__ + 0x04
#endif
#ifndef __SHRT_MAX__
#define __SHRT_MAX__ 32767
#endif
#ifndef TA1EX0_L_
#define TA1EX0_L_ 0x03A0
#endif
#ifndef __LDBL_MAX__
#define __LDBL_MAX__ 3.40282347e+38L
#endif
#ifndef P10REN_
#define P10REN_ __MSP430_PORT10_BASE__ + 0x07
#endif
#ifndef P7SEL_
#define P7SEL_ __MSP430_PORT7_BASE__ + 0x0A
#endif
#ifndef __MSP430_PORT8_BASE__
#define __MSP430_PORT8_BASE__ 0x260
#endif
#ifndef USCIB0_RXTX_VECTOR
#define USCIB0_RXTX_VECTOR 0x70
#endif
#ifndef SYSRSTIV_
#define SYSRSTIV_ __MSP430_SYS_BASE__ + 0x1E
#endif
#ifndef __UINTMAX_TYPE__
#define __UINTMAX_TYPE__ long long unsigned int
#endif
#ifndef __MSP430_PORT11_BASE__
#define __MSP430_PORT11_BASE__ 0x2A0
#endif
#ifndef P2REN_
#define P2REN_ __MSP430_PORT2_BASE__ + 0x07
#endif
#ifndef __DEC32_EPSILON__
#define __DEC32_EPSILON__ 1E-6DF
#endif
#ifndef MPYS_
#define MPYS_ __MSP430_MPY32_BASE__ + 0x02
#endif
#ifndef __msp430_headers_usci_h__
#define __msp430_headers_usci_h__ 
#endif
#ifndef UCA0BR0_
#define UCA0BR0_ 0x05C6
#endif
#ifndef TA0CCR0_H_
#define TA0CCR0_H_ 0x0353
#endif
#ifndef __LDBL_MAX_EXP__
#define __LDBL_MAX_EXP__ 128
#endif
#ifndef UCA0BR1_
#define UCA0BR1_ 0x05C7
#endif
#ifndef __WINT_MIN__
#define __WINT_MIN__ 0U
#endif
#ifndef P11DIR_
#define P11DIR_ __MSP430_PORT11_BASE__ + 0x04
#endif
#ifndef TA0CCR0_L_
#define TA0CCR0_L_ 0x0352
#endif
#ifndef P3IN_
#define P3IN_ __MSP430_PORT3_BASE__ + 0x00
#endif
#ifndef P10IN_
#define P10IN_ __MSP430_PORT10_BASE__ + 0x01
#endif
#ifndef __SCHAR_MAX__
#define __SCHAR_MAX__ 127
#endif
#ifndef USER_NMI_VECTOR
#define USER_NMI_VECTOR 0x7A
#endif
#ifndef TIMER1_A0_VECTOR
#define TIMER1_A0_VECTOR 0x62
#endif
#ifndef P2IFG_
#define P2IFG_ __MSP430_PORT2_BASE__ + 0x1D
#endif
#ifndef TAIFG
#define TAIFG 0x0001
#endif
#ifndef SFRRPCR_
#define SFRRPCR_ 0x0104
#endif
#ifndef UCSSEL_ACLK
#define UCSSEL_ACLK UCSSEL_1
#endif
#ifndef TASSEL_ACLK
#define TASSEL_ACLK TASSEL_1
#endif
#ifndef P4DS_
#define P4DS_ __MSP430_PORT4_BASE__ + 0x09
#endif
#ifndef P11DS_
#define P11DS_ __MSP430_PORT11_BASE__ + 0x08
#endif
#ifndef __DBL_DIG__
#define __DBL_DIG__ 6
#endif
#ifndef P3DIR_
#define P3DIR_ __MSP430_PORT3_BASE__ + 0x04
#endif
#ifndef TA0CCTL1_H_
#define TA0CCTL1_H_ 0x0345
#endif
#ifndef UCSCTL0_H_
#define UCSCTL0_H_ 0x0161
#endif
#ifndef USCIA3_RXTX_VECTOR
#define USCIA3_RXTX_VECTOR 0x58
#endif
#ifndef P6OUT_
#define P6OUT_ __MSP430_PORT6_BASE__ + 0x03
#endif
#ifndef __SIZEOF_INT__
#define __SIZEOF_INT__ 2
#endif
#ifndef __SIZEOF_POINTER__
#define __SIZEOF_POINTER__ 2
#endif
#ifndef TIMER0_B0_VECTOR
#define TIMER0_B0_VECTOR 0x78
#endif
#ifndef CAP
#define CAP 0x0100
#endif
#ifndef P6SEL_
#define P6SEL_ __MSP430_PORT6_BASE__ + 0x0B
#endif
#ifndef UCB0I2COA_
#define UCB0I2COA_ 0x05F0
#endif
#ifndef TA0CCTL1_L_
#define TA0CCTL1_L_ 0x0344
#endif
#ifndef __USER_LABEL_PREFIX__
#define __USER_LABEL_PREFIX__ 
#endif
#ifndef SFRIFG1_L_
#define SFRIFG1_L_ SFRIFG1_
#endif
#ifndef UCSCTL0_L_
#define UCSCTL0_L_ 0x0160
#endif
#ifndef TA1CTL_H_
#define TA1CTL_H_ 0x0381
#endif
#ifndef CCI
#define CCI 0x0008
#endif
#ifndef __STDC_HOSTED__
#define __STDC_HOSTED__ 1
#endif
#ifndef __LDBL_HAS_INFINITY__
#define __LDBL_HAS_INFINITY__ 1
#endif
#ifndef OUTMOD_RESET_SET
#define OUTMOD_RESET_SET OUTMOD_7
#endif
#ifndef SYSJMBI0_
#define SYSJMBI0_ __MSP430_SYS_BASE__ + 0x08
#endif
#ifndef P1REN_
#define P1REN_ __MSP430_PORT1_BASE__ + 0x06
#endif
#ifndef TA1CTL_L_
#define TA1CTL_L_ 0x0380
#endif
#ifndef SYSJMBI1_
#define SYSJMBI1_ __MSP430_SYS_BASE__ + 0x0A
#endif
#ifndef TASSEL_TACLK
#define TASSEL_TACLK TASSEL_0
#endif
#ifndef ID_DIV1
#define ID_DIV1 ID_0
#endif
#ifndef ID_DIV2
#define ID_DIV2 ID_1
#endif
#ifndef ID_DIV4
#define ID_DIV4 ID_2
#endif
#ifndef ID_DIV8
#define ID_DIV8 ID_3
#endif
#ifndef __MSP430_HEADERS_GPIO_5XXX_H
#define __MSP430_HEADERS_GPIO_5XXX_H 
#endif
#ifndef TACLR
#define TACLR 0x0004
#endif
#ifndef SFRIFG1_
#define SFRIFG1_ 0x0102
#endif
#ifndef __MSP430_PORT2_BASE__
#define __MSP430_PORT2_BASE__ 0x200
#endif
#ifndef TA0CCR3_H_
#define TA0CCR3_H_ 0x0359
#endif
#ifndef SYSBSLC_
#define SYSBSLC_ __MSP430_SYS_BASE__ + 0x02
#endif
#ifndef RESLO_
#define RESLO_ __MSP430_MPY32_BASE__ + 0x0A
#endif
#ifndef __FLT_EPSILON__
#define __FLT_EPSILON__ 1.19209290e-7F
#endif
#ifndef __MSP430__
#define __MSP430__ 1
#endif
#ifndef UCA0IRTCTL_
#define UCA0IRTCTL_ 0x05D2
#endif
#ifndef USCIB3_RXTX_VECTOR
#define USCIB3_RXTX_VECTOR 0x56
#endif
#ifndef P10DIR_
#define P10DIR_ __MSP430_PORT10_BASE__ + 0x05
#endif
#ifndef __LDBL_MIN__
#define __LDBL_MIN__ 1.17549435e-38L
#endif
#ifndef __MSP430_SYS_BASE__
#define __MSP430_SYS_BASE__ 0x180
#endif
#ifndef TA0CCR3_L_
#define TA0CCR3_L_ 0x0358
#endif
#ifndef P6IN_
#define P6IN_ __MSP430_PORT6_BASE__ + 0x01
#endif
#ifndef __DEC32_MAX__
#define __DEC32_MAX__ 9.999999E96DF
#endif
#ifndef MACS32H_
#define MACS32H_ __MSP430_MPY32_BASE__ + 0x1E
#endif
#ifndef CM0
#define CM0 0x4000
#endif
#ifndef CM1
#define CM1 0x8000
#endif
#ifndef P1IFG_
#define P1IFG_ __MSP430_PORT1_BASE__ + 0x1C
#endif
#ifndef P7DS_
#define P7DS_ __MSP430_PORT7_BASE__ + 0x08
#endif
#ifndef UCB0BR1_
#define UCB0BR1_ 0x05E7
#endif
#ifndef TA0CCTL4_H_
#define TA0CCTL4_H_ 0x034B
#endif
#ifndef COV
#define COV 0x0002
#endif
#ifndef OUTMOD_TOGGLE
#define OUTMOD_TOGGLE OUTMOD_4
#endif
#ifndef P2DIR_
#define P2DIR_ __MSP430_PORT2_BASE__ + 0x05
#endif
#ifndef __SIZEOF_LONG__
#define __SIZEOF_LONG__ 4
#endif
#ifndef UCSCTL3_H_
#define UCSCTL3_H_ 0x0167
#endif
#ifndef MACS32L_
#define MACS32L_ __MSP430_MPY32_BASE__ + 0x1C
#endif
#ifndef P5OUT_
#define P5OUT_ __MSP430_PORT5_BASE__ + 0x02
#endif
#ifndef __msp430_headers_unified_clock_system_h
#define __msp430_headers_unified_clock_system_h 
#endif
#ifndef __DECIMAL_DIG__
#define __DECIMAL_DIG__ 9
#endif
#ifndef TIMER0_A1_VECTOR
#define TIMER0_A1_VECTOR 0x6A
#endif
#ifndef TA0CCTL4_L_
#define TA0CCTL4_L_ 0x034A
#endif
#ifndef P5SEL_
#define P5SEL_ __MSP430_PORT5_BASE__ + 0x0A
#endif
#ifndef OP2H_
#define OP2H_ __MSP430_MPY32_BASE__ + 0x22
#endif
#ifndef UCSCTL3_L_
#define UCSCTL3_L_ 0x0166
#endif
#ifndef SYSJMBI1_H_
#define SYSJMBI1_H_ __MSP430_SYS_BASE__ + 0x0B
#endif
#ifndef __LDBL_HAS_QUIET_NAN__
#define __LDBL_HAS_QUIET_NAN__ 1
#endif
#ifndef TA1CCTL2_H_
#define TA1CCTL2_H_ 0x0387
#endif
#ifndef OP2L_
#define OP2L_ __MSP430_MPY32_BASE__ + 0x20
#endif
#ifndef UCSCTL0_
#define UCSCTL0_ 0x0160
#endif
#ifndef __GNUC__
#define __GNUC__ 4
#endif
#ifndef UCSCTL1_
#define UCSCTL1_ 0x0162
#endif
#ifndef SYSJMBI1_L_
#define SYSJMBI1_L_ __MSP430_SYS_BASE__ + 0x0A
#endif
#ifndef PORT2_VECTOR
#define PORT2_VECTOR 0x54
#endif
#ifndef UCSCTL2_
#define UCSCTL2_ 0x0164
#endif
#ifndef __FLT_HAS_DENORM__
#define __FLT_HAS_DENORM__ 1
#endif
#ifndef __SIZEOF_LONG_DOUBLE__
#define __SIZEOF_LONG_DOUBLE__ 4
#endif
#ifndef TA1CCTL2_L_
#define TA1CCTL2_L_ 0x0386
#endif
#ifndef UCSCTL3_
#define UCSCTL3_ 0x0166
#endif
#ifndef TA1CTL_
#define TA1CTL_ 0x0380
#endif
#ifndef SYSUNIV_
#define SYSUNIV_ __MSP430_SYS_BASE__ + 0x1A
#endif
#ifndef UCSCTL4_
#define UCSCTL4_ 0x0168
#endif
#ifndef __BIGGEST_ALIGNMENT__
#define __BIGGEST_ALIGNMENT__ 2
#endif
#ifndef __MSP430_PORT7_BASE__
#define __MSP430_PORT7_BASE__ 0x260
#endif
#ifndef UCSCTL5_
#define UCSCTL5_ 0x016A
#endif
#ifndef P9IN_
#define P9IN_ __MSP430_PORT9_BASE__ + 0x00
#endif
#ifndef UCSCTL6_
#define UCSCTL6_ 0x016C
#endif
#ifndef TA1R_
#define TA1R_ 0x0390
#endif
#ifndef UCSCTL7_
#define UCSCTL7_ 0x016E
#endif
#ifndef __MSP430_PORT10_BASE__
#define __MSP430_PORT10_BASE__ 0x280
#endif
#ifndef UCSCTL8_
#define UCSCTL8_ 0x0170
#endif
#ifndef __DBL_HAS_INFINITY__
#define __DBL_HAS_INFINITY__ 1
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef GIE
#define GIE 0x0008
#endif
#ifndef TA1CCR1_H_
#define TA1CCR1_H_ 0x0395
#endif
#ifndef P1DIR_
#define P1DIR_ __MSP430_PORT1_BASE__ + 0x04
#endif
#ifndef TA1CCR2_H_
#define TA1CCR2_H_ 0x0397
#endif
#ifndef TA1IV_L_
#define TA1IV_L_ 0x03AE
#endif
#ifndef P4OUT_
#define P4OUT_ __MSP430_PORT4_BASE__ + 0x03
#endif
#ifndef UCB0I2CSA_
#define UCB0I2CSA_ 0x05F2
#endif
#ifndef UCA0STAT_
#define UCA0STAT_ 0x05CA
#endif
#ifndef MC_CONT
#define MC_CONT MC_2
#endif
#ifndef TA1CCR1_L_
#define TA1CCR1_L_ 0x0394
#endif
#ifndef UCSCTL6_L_
#define UCSCTL6_L_ 0x016C
#endif
#ifndef UCSSEL_SMCLK
#define UCSSEL_SMCLK UCSSEL_2
#endif
#ifndef P4SEL_
#define P4SEL_ __MSP430_PORT4_BASE__ + 0x0B
#endif
#ifndef SYSARB_
#define SYSARB_ __MSP430_SYS_BASE__ + 0x04
#endif
#ifndef __LDBL_HAS_DENORM__
#define __LDBL_HAS_DENORM__ 1
#endif
#ifndef MPY32H_
#define MPY32H_ __MSP430_MPY32_BASE__ + 0x12
#endif
#ifndef __DEC128_MAX__
#define __DEC128_MAX__ 9.999999999999999999999999999999999E6144DL
#endif
#ifndef __USING_SJLJ_EXCEPTIONS__
#define __USING_SJLJ_EXCEPTIONS__ 1
#endif
#ifndef __DEC32_MIN__
#define __DEC32_MIN__ 1E-95DF
#endif
#ifndef UCSCTL7_H_
#define UCSCTL7_H_ 0x016F
#endif
#ifndef __DBL_MAX_EXP__
#define __DBL_MAX_EXP__ 128
#endif
#ifndef __DEC128_EPSILON__
#define __DEC128_EPSILON__ 1E-33DL
#endif
#ifndef UCB0MCTL_
#define UCB0MCTL_ 0x05E8
#endif
#ifndef MPY32L_
#define MPY32L_ __MSP430_MPY32_BASE__ + 0x10
#endif
#ifndef __PTRDIFF_MAX__
#define __PTRDIFF_MAX__ 2147483647L
#endif
#ifndef UCSCTL4_L_
#define UCSCTL4_L_ 0x0168
#endif
#ifndef UCA0CTL0_
#define UCA0CTL0_ 0x05C1
#endif
#ifndef TA0CTL_
#define TA0CTL_ 0x0340
#endif
#ifndef UCA0CTL1_
#define UCA0CTL1_ 0x05C0
#endif
#ifndef PJIN_
#define PJIN_ __MSP430_PORTJ_BASE__ + 0x00
#endif
#ifndef PJREN_
#define PJREN_ __MSP430_PORTJ_BASE__ + 0x06
#endif
#ifndef P11OUT_
#define P11OUT_ __MSP430_PORT11_BASE__ + 0x02
#endif
#ifndef __LONG_LONG_MAX__
#define __LONG_LONG_MAX__ 9223372036854775807LL
#endif
#ifndef __SIZEOF_SIZE_T__
#define __SIZEOF_SIZE_T__ 2
#endif
#ifndef OUTMOD0
#define OUTMOD0 0x0020
#endif
#ifndef OUTMOD1
#define OUTMOD1 0x0040
#endif
#ifndef OUTMOD2
#define OUTMOD2 0x0080
#endif
#ifndef MSP430_NO_HWMUL
#define MSP430_NO_HWMUL 1
#endif
#ifndef __SIZEOF_WINT_T__
#define __SIZEOF_WINT_T__ 2
#endif
#ifndef P11SEL_
#define P11SEL_ __MSP430_PORT11_BASE__ + 0x0A
#endif
#ifndef OUTMOD_TOGGLE_RESET
#define OUTMOD_TOGGLE_RESET OUTMOD_2
#endif
#ifndef __MSP430_PORT1_BASE__
#define __MSP430_PORT1_BASE__ 0x200
#endif
#ifndef P3OUT_
#define P3OUT_ __MSP430_PORT3_BASE__ + 0x02
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 1002
#endif
#ifndef __msp430_headers_timera_h__
#define __msp430_headers_timera_h__ 
#endif
#ifndef TASSEL0
#define TASSEL0 0x0100
#endif
#ifndef TASSEL1
#define TASSEL1 0x0200
#endif
#ifndef TASSEL2
#define TASSEL2 0x0400
#endif
#ifndef P1IE_
#define P1IE_ __MSP430_PORT1_BASE__ + 0x1A
#endif
#ifndef P3SEL_
#define P3SEL_ __MSP430_PORT3_BASE__ + 0x0A
#endif
#ifndef TA0IV_
#define TA0IV_ 0x036E
#endif
#ifndef MC_STOP
#define MC_STOP MC_0
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef __MSP430_IVCNT__
#define __MSP430_IVCNT__ 16
#endif
#ifndef UCB0IV_H_
#define UCB0IV_H_ 0x05FF
#endif
#ifndef __MSP430_MPY32_BASE__
#define __MSP430_MPY32_BASE__ 0x4C0
#endif
#ifndef SYSSNIV_
#define SYSSNIV_ __MSP430_SYS_BASE__ + 0x1C
#endif
#ifndef TIMER0_A0_VECTOR
#define TIMER0_A0_VECTOR 0x6C
#endif
#ifndef P1IN_
#define P1IN_ __MSP430_PORT1_BASE__ + 0x00
#endif
#ifndef __MSP430_HAS_T1A3__
#define __MSP430_HAS_T1A3__ 
#endif
#ifndef UCA0IFG_
#define UCA0IFG_ 0x05DD
#endif
#ifndef P10OUT_
#define P10OUT_ __MSP430_PORT10_BASE__ + 0x03
#endif
#ifndef UCB0IV_L_
#define UCB0IV_L_ 0x05FE
#endif
#ifndef P2DS_
#define P2DS_ __MSP430_PORT2_BASE__ + 0x09
#endif
#ifndef __DEC128_MIN__
#define __DEC128_MIN__ 1E-6143DL
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef __DBL_HAS_DENORM__
#define __DBL_HAS_DENORM__ 1
#endif
#ifndef P2OUT_
#define P2OUT_ __MSP430_PORT2_BASE__ + 0x03
#endif
#ifndef PORT1_VECTOR
#define PORT1_VECTOR 0x5E
#endif
#ifndef SYSJMBO0_H_
#define SYSJMBO0_H_ __MSP430_SYS_BASE__ + 0x0D
#endif
#ifndef USCIA2_RXTX_VECTOR
#define USCIA2_RXTX_VECTOR 0x68
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef P1IV_
#define P1IV_ __MSP430_PORT1_BASE__ + 0x0E
#endif
#ifndef SFRIFG1_H_
#define SFRIFG1_H_ SFRIFG1_ + 0x01
#endif
#ifndef UCA0IRRCTL_
#define UCA0IRRCTL_ 0x05D3
#endif
#ifndef SCCI
#define SCCI 0x0400
#endif
#ifndef P2SEL_
#define P2SEL_ __MSP430_PORT2_BASE__ + 0x0B
#endif
#ifndef __MSP430_PORT6_BASE__
#define __MSP430_PORT6_BASE__ 0x240
#endif
#ifndef __msp430x54xx
#define __msp430x54xx 
#endif
#ifndef __FLT_MANT_DIG__
#define __FLT_MANT_DIG__ 24
#endif
#ifndef DMA_VECTOR
#define DMA_VECTOR 0x64
#endif
#ifndef __VERSION__
#define __VERSION__ "4.5.3"
#endif
#ifndef PJDIR_
#define PJDIR_ __MSP430_PORTJ_BASE__ + 0x04
#endif
#ifndef SYSJMBO0_L_
#define SYSJMBO0_L_ __MSP430_SYS_BASE__ + 0x0C
#endif
#ifndef WDTCTL_
#define WDTCTL_ __MSP430_WDT_A_BASE__ + 0x0C
#endif
#ifndef UCB0BR0_
#define UCB0BR0_ 0x05E6
#endif
#ifndef TA0CCR1_H_
#define TA0CCR1_H_ 0x0355
#endif
#ifndef TA0CCTL0_
#define TA0CCTL0_ 0x0342
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef MAC32H_
#define MAC32H_ __MSP430_MPY32_BASE__ + 0x1A
#endif
#ifndef P10SEL_
#define P10SEL_ __MSP430_PORT10_BASE__ + 0x0B
#endif
#ifndef TA0CCTL1_
#define TA0CCTL1_ 0x0344
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef UCSCTL2_L_
#define UCSCTL2_L_ 0x0164
#endif
#ifndef TA0CCTL2_
#define TA0CCTL2_ 0x0346
#endif
#ifndef __MSP430_HEADERS_WDT_A_H
#define __MSP430_HEADERS_WDT_A_H 
#endif
#ifndef TA0CCTL3_
#define TA0CCTL3_ 0x0348
#endif
#ifndef TA0CCR1_L_
#define TA0CCR1_L_ 0x0354
#endif
#ifndef P4IN_
#define P4IN_ __MSP430_PORT4_BASE__ + 0x01
#endif
#ifndef TA0CCTL4_
#define TA0CCTL4_ 0x034A
#endif
#ifndef P11IN_
#define P11IN_ __MSP430_PORT11_BASE__ + 0x00
#endif
#ifndef MAC32L_
#define MAC32L_ __MSP430_MPY32_BASE__ + 0x18
#endif
#ifndef USCIB2_RXTX_VECTOR
#define USCIB2_RXTX_VECTOR 0x66
#endif
#ifndef P5DS_
#define P5DS_ __MSP430_PORT5_BASE__ + 0x08
#endif
#ifndef TA0CCTL2_H_
#define TA0CCTL2_H_ 0x0347
#endif
#ifndef UCSCTL1_H_
#define UCSCTL1_H_ 0x0163
#endif
#ifndef UCSCTL6_H_
#define UCSCTL6_H_ 0x016D
#endif
#ifndef SUMEXT_
#define SUMEXT_ __MSP430_MPY32_BASE__ + 0x0E
#endif
#ifndef P1OUT_
#define P1OUT_ __MSP430_PORT1_BASE__ + 0x02
#endif
#ifndef OP2_
#define OP2_ __MSP430_MPY32_BASE__ + 0x08
#endif
#ifndef TA0CCTL2_L_
#define TA0CCTL2_L_ 0x0346
#endif
#ifndef __DEC64_EPSILON__
#define __DEC64_EPSILON__ 1E-15DD
#endif
#ifndef UCSCTL1_L_
#define UCSCTL1_L_ 0x0162
#endif
#ifndef P1SEL_
#define P1SEL_ __MSP430_PORT1_BASE__ + 0x0A
#endif
#ifndef OUT
#define OUT 0x0004
#endif
#ifndef CM_POS
#define CM_POS CM_1
#endif
#ifndef TA1CCTL0_H_
#define TA1CCTL0_H_ 0x0383
#endif
#ifndef TASSEL_SMCLK
#define TASSEL_SMCLK TASSEL_2
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef TA0CCR4_H_
#define TA0CCR4_H_ 0x035B
#endif
#ifndef TA1CCTL0_L_
#define TA1CCTL0_L_ 0x0382
#endif
#ifndef SCS
#define SCS 0x0800
#endif
#ifndef TA0CCR4_L_
#define TA0CCR4_L_ 0x035A
#endif
#ifndef UCB0RXBUF_
#define UCB0RXBUF_ 0x05EC
#endif
#ifndef P7IN_
#define P7IN_ __MSP430_PORT7_BASE__ + 0x00
#endif
#ifndef __MSP430_HEADERS_MPY32_H
#define __MSP430_HEADERS_MPY32_H 
#endif
#ifndef __FLT_RADIX__
#define __FLT_RADIX__ 2
#endif
#ifndef __LDBL_EPSILON__
#define __LDBL_EPSILON__ 1.19209290e-7L
#endif
#ifndef OUTMOD_RESET
#define OUTMOD_RESET OUTMOD_5
#endif
#ifndef P8DS_
#define P8DS_ __MSP430_PORT8_BASE__ + 0x09
#endif
#ifndef UCSCTL4_H_
#define UCSCTL4_H_ 0x0169
#endif
#ifndef TA0EX0_H_
#define TA0EX0_H_ 0x0361
#endif
#ifndef CM_NEG
#define CM_NEG CM_2
#endif
#ifndef __SIZEOF_PTRDIFF_T__
#define __SIZEOF_PTRDIFF_T__ 4
#endif
#ifndef SYSBERRIV_
#define SYSBERRIV_ __MSP430_SYS_BASE__ + 0x18
#endif
#ifndef P9REN_
#define P9REN_ __MSP430_PORT9_BASE__ + 0x06
#endif
#ifndef TA0EX0_L_
#define TA0EX0_L_ 0x0360
#endif
#ifndef SFRRPCR_H_
#define SFRRPCR_H_ SFRRPCR_ + 0x01
#endif
#ifndef __DEC32_SUBNORMAL_MIN__
#define __DEC32_SUBNORMAL_MIN__ 0.000001E-95DF
#endif
#ifndef NMI_VECTOR
#define NMI_VECTOR 0x7C
#endif
#ifndef SYSCTL_
#define SYSCTL_ __MSP430_SYS_BASE__ + 0x00
#endif
#ifndef __MSP430F110__
#define __MSP430F110__ 1
#endif
#ifndef SFRRPCR_L_
#define SFRRPCR_L_ SFRRPCR_
#endif
#ifndef TA1R_H_
#define TA1R_H_ 0x0391
#endif
#ifndef __FLT_HAS_QUIET_NAN__
#define __FLT_HAS_QUIET_NAN__ 1
#endif
#ifndef __FLT_MAX_10_EXP__
#define __FLT_MAX_10_EXP__ 38
#endif
#ifndef __LONG_MAX__
#define __LONG_MAX__ 2147483647L
#endif
#ifndef __DEC128_SUBNORMAL_MIN__
#define __DEC128_SUBNORMAL_MIN__ 0.000000000000000000000000000000001E-6143DL
#endif
#ifndef __FLT_HAS_INFINITY__
#define __FLT_HAS_INFINITY__ 1
#endif
#ifndef TASSEL_INCLK
#define TASSEL_INCLK TASSEL_3
#endif
#ifndef __DEC64_MAX__
#define __DEC64_MAX__ 9.999999999999999E384DD
#endif
#ifndef TA1R_L_
#define TA1R_L_ 0x0390
#endif
#ifndef __MSP430_PORT5_BASE__
#define __MSP430_PORT5_BASE__ 0x240
#endif
#ifndef __MSP430_HEADERS_SYS_H
#define __MSP430_HEADERS_SYS_H 
#endif
#ifndef __CHAR16_TYPE__
#define __CHAR16_TYPE__ short unsigned int
#endif
#ifndef TA0CCR0_
#define TA0CCR0_ 0x0352
#endif
#ifndef __PRAGMA_REDEFINE_EXTNAME
#define __PRAGMA_REDEFINE_EXTNAME 1
#endif
#ifndef TA0CCR1_
#define TA0CCR1_ 0x0354
#endif
#ifndef TA0IV_H_
#define TA0IV_H_ 0x036F
#endif
#ifndef OUTMOD_OUT
#define OUTMOD_OUT OUTMOD_0
#endif
#ifndef __DEC64_MANT_DIG__
#define __DEC64_MANT_DIG__ 16
#endif
#ifndef TA0CCR2_
#define TA0CCR2_ 0x0356
#endif
#ifndef TA0CCR3_
#define TA0CCR3_ 0x0358
#endif
#ifndef WDT_VECTOR
#define WDT_VECTOR 0x74
#endif
#ifndef TA0CCR4_
#define TA0CCR4_ 0x035A
#endif
#ifndef __DEC32_MAX_EXP__
#define __DEC32_MAX_EXP__ 97
#endif
#ifndef TA0IV_L_
#define TA0IV_L_ 0x036E
#endif
#ifndef TA1CCR2_L_
#define TA1CCR2_L_ 0x0396
#endif
#ifndef UCSCTL7_L_
#define UCSCTL7_L_ 0x016E
#endif
#ifndef P8REN_
#define P8REN_ __MSP430_PORT8_BASE__ + 0x07
#endif
#ifndef OUTMOD_SET
#define OUTMOD_SET OUTMOD_1
#endif
#ifndef TA0CTL_H_
#define TA0CTL_H_ 0x0341
#endif
#ifndef __MSP430_HAS_USCI2_5__
#define __MSP430_HAS_USCI2_5__ 
#endif
#ifndef MPYS32H_
#define MPYS32H_ __MSP430_MPY32_BASE__ + 0x16
#endif
#ifndef __LDBL_MANT_DIG__
#define __LDBL_MANT_DIG__ 24
#endif
#ifndef SYSCTL_H_
#define SYSCTL_H_ __MSP430_SYS_BASE__ + 0x01
#endif
#ifndef __MSP430_WDT_A_BASE__
#define __MSP430_WDT_A_BASE__ 0x150
#endif
#ifndef PJOUT_
#define PJOUT_ __MSP430_PORTJ_BASE__ + 0x02
#endif
#ifndef __DBL_HAS_QUIET_NAN__
#define __DBL_HAS_QUIET_NAN__ 1
#endif
#ifndef TA0CTL_L_
#define TA0CTL_L_ 0x0340
#endif
#ifndef TA0R_H_
#define TA0R_H_ 0x0351
#endif
#ifndef MPYS32L_
#define MPYS32L_ __MSP430_MPY32_BASE__ + 0x14
#endif
#ifndef SYSCTL_L_
#define SYSCTL_L_ __MSP430_SYS_BASE__ + 0x00
#endif
#ifndef __WCHAR_TYPE__
#define __WCHAR_TYPE__ int
#endif
#ifndef __SIZEOF_FLOAT__
#define __SIZEOF_FLOAT__ 4
#endif
#ifndef P9DIR_
#define P9DIR_ __MSP430_PORT9_BASE__ + 0x04
#endif
#ifndef SFRIE1_H_
#define SFRIE1_H_ SFRIE1_ + 0x01
#endif
#ifndef TA0R_L_
#define TA0R_L_ 0x0350
#endif
#ifndef __FLT_DIG__
#define __FLT_DIG__ 6
#endif
#ifndef SYSJMBC_
#define SYSJMBC_ __MSP430_SYS_BASE__ + 0x06
#endif
#ifndef __MSPGCC__
#define __MSPGCC__ 20110706
#endif
#ifndef SFRIE1_L_
#define SFRIE1_L_ SFRIE1_
#endif
#ifndef __INT_MAX__
#define __INT_MAX__ 32767
#endif
#ifndef MACS_
#define MACS_ __MSP430_MPY32_BASE__ + 0x06
#endif
#ifndef TA1CCR0_
#define TA1CCR0_ 0x0392
#endif
#ifndef P2IE_
#define P2IE_ __MSP430_PORT2_BASE__ + 0x1B
#endif
#ifndef TA1IV_
#define TA1IV_ 0x03AE
#endif
#ifndef TA1CCR1_
#define TA1CCR1_ 0x0394
#endif
#ifndef P7REN_
#define P7REN_ __MSP430_PORT7_BASE__ + 0x06
#endif
#ifndef __FLT_MAX_EXP__
#define __FLT_MAX_EXP__ 128
#endif
#ifndef UCA0RXBUF_
#define UCA0RXBUF_ 0x05CC
#endif
#ifndef TA1CCR2_
#define TA1CCR2_ 0x0396
#endif
#ifndef USCIA1_RXTX_VECTOR
#define USCIA1_RXTX_VECTOR 0x5C
#endif
#ifndef __DBL_MANT_DIG__
#define __DBL_MANT_DIG__ 24
#endif
#ifndef __DEC64_MIN__
#define __DEC64_MIN__ 1E-383DD
#endif
#ifndef __WINT_TYPE__
#define __WINT_TYPE__ unsigned int
#endif
#ifndef __SIZEOF_SHORT__
#define __SIZEOF_SHORT__ 2
#endif
#ifndef UCB0TXBUF_
#define UCB0TXBUF_ 0x05EE
#endif
#ifndef __MSP430_HAS_USCI1_5__
#define __MSP430_HAS_USCI1_5__ 
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef CCIE
#define CCIE 0x0010
#endif
#ifndef MAC_
#define MAC_ __MSP430_MPY32_BASE__ + 0x04
#endif
#ifndef SFRIE1_
#define SFRIE1_ 0x0100
#endif
#ifndef __LDBL_MAX_10_EXP__
#define __LDBL_MAX_10_EXP__ 38
#endif
#ifndef P2IN_
#define P2IN_ __MSP430_PORT2_BASE__ + 0x01
#endif
#ifndef P8DIR_
#define P8DIR_ __MSP430_PORT8_BASE__ + 0x05
#endif
#ifndef P3DS_
#define P3DS_ __MSP430_PORT3_BASE__ + 0x08
#endif
#ifndef P10DS_
#define P10DS_ __MSP430_PORT10_BASE__ + 0x09
#endif
#ifndef __SIZEOF_WCHAR_T__
#define __SIZEOF_WCHAR_T__ 2
#endif
#ifndef TA0CCTL0_H_
#define TA0CCTL0_H_ 0x0343
#endif
#ifndef OUTMOD_SET_RESET
#define OUTMOD_SET_RESET OUTMOD_3
#endif
#ifndef USCIB1_RXTX_VECTOR
#define USCIB1_RXTX_VECTOR 0x5A
#endif
#ifndef __MSP430_PORTJ_BASE__
#define __MSP430_PORTJ_BASE__ 0x320
#endif
#ifndef OUTMOD_TOGGLE_SET
