jankaluza/qsimkit/CPU/Variants/msp430x54xx.cpp
#define OUTMOD_TOGGLE_SET OUTMOD_6
#endif
#ifndef SYSJMBO1_H_
#define SYSJMBO1_H_ __MSP430_SYS_BASE__ + 0x0F
#endif
#ifndef TA0CCTL0_L_
#define TA0CCTL0_L_ 0x0342
#endif
#ifndef P2IV_
#define P2IV_ __MSP430_PORT2_BASE__ + 0x1E
#endif
#ifndef P6REN_
#define P6REN_ __MSP430_PORT6_BASE__ + 0x07
#endif
#ifndef UCA0ABCTL_
#define UCA0ABCTL_ 0x05D0
#endif
#ifndef ID0
#define ID0 0x0040
#endif
#ifndef ID1
#define ID1 0x0080
#endif
#ifndef CCIS0
#define CCIS0 0x1000
#endif
#ifndef CCIS1
#define CCIS1 0x2000
#endif
#ifndef SYSJMBO1_L_
#define SYSJMBO1_L_ __MSP430_SYS_BASE__ + 0x0E
#endif
#ifndef __MSP430_PORT4_BASE__
#define __MSP430_PORT4_BASE__ 0x220
#endif
#ifndef SYSJMBO0_
#define SYSJMBO0_ __MSP430_SYS_BASE__ + 0x0C
#endif
#ifndef __DEC_EVAL_METHOD__
#define __DEC_EVAL_METHOD__ 2
#endif
#ifndef SYSJMBO1_
#define SYSJMBO1_ __MSP430_SYS_BASE__ + 0x0E
#endif
#ifndef UCB0CTL0_
#define UCB0CTL0_ 0x05E1
#endif
#ifndef __MSP430_HAS_USCI0_5__
#define __MSP430_HAS_USCI0_5__ 
#endif
#ifndef TA0CCR2_H_
#define TA0CCR2_H_ 0x0357
#endif
#ifndef UCB0CTL1_
#define UCB0CTL1_ 0x05E0
#endif
#ifndef UCA0MCTL_
#define UCA0MCTL_ 0x05C8
#endif
#ifndef __INTMAX_MAX__
#define __INTMAX_MAX__ 9223372036854775807LL
#endif
#ifndef __FLT_DENORM_MIN__
#define __FLT_DENORM_MIN__ 1.40129846e-45F
#endif
#ifndef TA0CCR2_L_
#define TA0CCR2_L_ 0x0356
#endif
#ifndef P5IN_
#define P5IN_ __MSP430_PORT5_BASE__ + 0x00
#endif
#ifndef P7DIR_
#define P7DIR_ __MSP430_PORT7_BASE__ + 0x04
#endif
#ifndef P6DS_
#define P6DS_ __MSP430_PORT6_BASE__ + 0x09
#endif
#ifndef __MSP430_HAS_UCS__
#define __MSP430_HAS_UCS__ 
#endif
#ifndef __CHAR32_TYPE__
#define __CHAR32_TYPE__ unsigned int
#endif
#ifndef TA0CCTL3_H_
#define TA0CCTL3_H_ 0x0349
#endif
#ifndef __FLT_MAX__
#define __FLT_MAX__ 3.40282347e+38F
#endif
#ifndef UCSCTL2_H_
#define UCSCTL2_H_ 0x0165
#endif
#ifndef UCB0STAT_
#define UCB0STAT_ 0x05EA
#endif
#ifndef __SIZEOF_DOUBLE__
#define __SIZEOF_DOUBLE__ 4
#endif
#ifndef TA0CCTL3_L_
#define TA0CCTL3_L_ 0x0348
#endif
#ifndef UCB0IE_
#define UCB0IE_ 0x05FC
#endif
#ifndef __INTMAX_TYPE__
#define __INTMAX_TYPE__ long long int
#endif
#ifndef __DEC128_MAX_EXP__
#define __DEC128_MAX_EXP__ 6145
#endif
#ifndef SYSJMBI0_H_
#define SYSJMBI0_H_ __MSP430_SYS_BASE__ + 0x09
#endif
#ifndef P5REN_
#define P5REN_ __MSP430_PORT5_BASE__ + 0x06
#endif
#ifndef __GNUC_MINOR__
#define __GNUC_MINOR__ 5
#endif
#ifndef TA1CCTL1_H_
#define TA1CCTL1_H_ 0x0385
#endif
#ifndef __UINTMAX_MAX__
#define __UINTMAX_MAX__ 18446744073709551615ULL
#endif
#ifndef __DEC32_MANT_DIG__
#define __DEC32_MANT_DIG__ 7
#endif
#ifndef __DBL_MAX_10_EXP__
#define __DBL_MAX_10_EXP__ 38
#endif
#ifndef __LDBL_DENORM_MIN__
#define __LDBL_DENORM_MIN__ 1.40129846e-45L
#endif
#ifndef SYSJMBI0_L_
#define SYSJMBI0_L_ __MSP430_SYS_BASE__ + 0x08
#endif
#ifndef AD12_A_VECTOR
#define AD12_A_VECTOR 0x6E
#endif
#ifndef __MSP430_PORT9_BASE__
#define __MSP430_PORT9_BASE__ 0x280
#endif
#ifndef __STDC__
#define __STDC__ 1
#endif
#ifndef MC1
#define MC1 0x0020
#endif
#ifndef TA1CCTL1_L_
#define TA1CCTL1_L_ 0x0384
#endif
#ifndef __PTRDIFF_TYPE__
#define __PTRDIFF_TYPE__ long int
#endif
#ifndef P2IES_
#define P2IES_ __MSP430_PORT2_BASE__ + 0x19
#endif
#ifndef MPY32CTL0_
#define MPY32CTL0_ __MSP430_MPY32_BASE__ + 0x2C
#endif
#ifndef MSP430
#define MSP430 1
#endif
#ifndef UCA0IV_H_
#define UCA0IV_H_ 0x05DF
#endif
#ifndef P8IN_
#define P8IN_ __MSP430_PORT8_BASE__ + 0x01
#endif
#ifndef P9DS_
#define P9DS_ __MSP430_PORT9_BASE__ + 0x08
#endif
#ifndef P6DIR_
#define P6DIR_ __MSP430_PORT6_BASE__ + 0x05
#endif
#ifndef __DEC64_SUBNORMAL_MIN__
#define __DEC64_SUBNORMAL_MIN__ 0.000000000000001E-383DD
#endif
#ifndef __DEC128_MANT_DIG__
#define __DEC128_MANT_DIG__ 34
#endif
#ifndef __MSP430_CPU__
#define __MSP430_CPU__ 0
#endif
#ifndef P9OUT_
#define P9OUT_ __MSP430_PORT9_BASE__ + 0x02
#endif
#ifndef TA1CCR0_H_
#define TA1CCR0_H_ 0x0393
#endif
#ifndef UCA0IV_L_
#define UCA0IV_L_ 0x05DE
#endif
#ifndef __SIZEOF_LONG_LONG__
#define __SIZEOF_LONG_LONG__ 8
#endif
#ifndef UCSCTL5_H_
#define UCSCTL5_H_ 0x016B
#endif
#ifndef UCA0TXBUF_
#define UCA0TXBUF_ 0x05CE
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef __LDBL_DIG__
#define __LDBL_DIG__ 6
#endif
#ifndef P9SEL_
#define P9SEL_ __MSP430_PORT9_BASE__ + 0x0A
#endif
#ifndef __GNUC_GNU_INLINE__
#define __GNUC_GNU_INLINE__ 1
#endif
#ifndef UCB0IV_
#define UCB0IV_ 0x05FE
#endif
#ifndef TA1CCR0_L_
#define TA1CCR0_L_ 0x0392
#endif
#ifndef UCSCTL5_L_
#define UCSCTL5_L_ 0x016A
#endif
#ifndef UCA0IE_
#define UCA0IE_ 0x05DC
#endif
#ifndef TIMER1_A1_VECTOR
#define TIMER1_A1_VECTOR 0x60
#endif
#ifndef P4REN_
#define P4REN_ __MSP430_PORT4_BASE__ + 0x07
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

class Variant_msp430x54xx : public Variant {
	public:
		Variant_msp430x54xx() {}
		virtual ~Variant_msp430x54xx() {}
		const char *getName() { return "msp430x54xx"; }

		unsigned int getP1DIR() {
#ifdef P1DIR_
			return P1DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP1IE() {
#ifdef P1IE_
			return P1IE_;
#else
			return 0;
#endif
		}


		unsigned int getP1IES() {
#ifdef P1IES_
			return P1IES_;
#else
			return 0;
#endif
		}


		unsigned int getP1IFG() {
#ifdef P1IFG_
			return P1IFG_;
#else
			return 0;
#endif
		}


		unsigned int getP1IN() {
#ifdef P1IN_
			return P1IN_;
#else
			return 0;
#endif
		}


		unsigned int getP1OUT() {
#ifdef P1OUT_
			return P1OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP1REN() {
#ifdef P1REN_
			return P1REN_;
#else
			return 0;
#endif
		}


		unsigned int getP1SEL() {
#ifdef P1SEL_
			return P1SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP2DIR() {
#ifdef P2DIR_
			return P2DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP2IE() {
#ifdef P2IE_
			return P2IE_;
#else
			return 0;
#endif
		}


		unsigned int getP2IES() {
#ifdef P2IES_
			return P2IES_;
#else
			return 0;
#endif
		}


		unsigned int getP2IFG() {
#ifdef P2IFG_
			return P2IFG_;
#else
			return 0;
#endif
		}


		unsigned int getP2IN() {
#ifdef P2IN_
			return P2IN_;
#else
			return 0;
#endif
		}


		unsigned int getP2OUT() {
#ifdef P2OUT_
			return P2OUT_;
#else
			return 0;
#endif
		}


