jankaluza/qsimkit/CPU/Variants/msp430x54xx.cpp
		unsigned int getP2REN() {
#ifdef P2REN_
			return P2REN_;
#else
			return 0;
#endif
		}


		unsigned int getP2SEL() {
#ifdef P2SEL_
			return P2SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP3DIR() {
#ifdef P3DIR_
			return P3DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP3IN() {
#ifdef P3IN_
			return P3IN_;
#else
			return 0;
#endif
		}


		unsigned int getP3OUT() {
#ifdef P3OUT_
			return P3OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP3REN() {
#ifdef P3REN_
			return P3REN_;
#else
			return 0;
#endif
		}


		unsigned int getP3SEL() {
#ifdef P3SEL_
			return P3SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP4DIR() {
#ifdef P4DIR_
			return P4DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP4IN() {
#ifdef P4IN_
			return P4IN_;
#else
			return 0;
#endif
		}


		unsigned int getP4OUT() {
#ifdef P4OUT_
			return P4OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP4REN() {
#ifdef P4REN_
			return P4REN_;
#else
			return 0;
#endif
		}


		unsigned int getP4SEL() {
#ifdef P4SEL_
			return P4SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP5DIR() {
#ifdef P5DIR_
			return P5DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP5IN() {
#ifdef P5IN_
			return P5IN_;
#else
			return 0;
#endif
		}


		unsigned int getP5OUT() {
#ifdef P5OUT_
			return P5OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP5REN() {
#ifdef P5REN_
			return P5REN_;
#else
			return 0;
#endif
		}


		unsigned int getP5SEL() {
#ifdef P5SEL_
			return P5SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP6DIR() {
#ifdef P6DIR_
			return P6DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP6IN() {
#ifdef P6IN_
			return P6IN_;
#else
			return 0;
#endif
		}


		unsigned int getP6OUT() {
#ifdef P6OUT_
			return P6OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP6REN() {
#ifdef P6REN_
			return P6REN_;
#else
			return 0;
#endif
		}


		unsigned int getP6SEL() {
#ifdef P6SEL_
			return P6SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP7DIR() {
#ifdef P7DIR_
			return P7DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP7IN() {
#ifdef P7IN_
			return P7IN_;
#else
			return 0;
#endif
		}


		unsigned int getP7OUT() {
#ifdef P7OUT_
			return P7OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP7REN() {
#ifdef P7REN_
			return P7REN_;
#else
			return 0;
#endif
		}


		unsigned int getP7SEL() {
#ifdef P7SEL_
			return P7SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP8DIR() {
#ifdef P8DIR_
			return P8DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP8IN() {
#ifdef P8IN_
			return P8IN_;
#else
			return 0;
#endif
		}


		unsigned int getP8OUT() {
#ifdef P8OUT_
			return P8OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP8REN() {
#ifdef P8REN_
			return P8REN_;
#else
			return 0;
#endif
		}


		unsigned int getP8SEL() {
#ifdef P8SEL_
			return P8SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP9DIR() {
#ifdef P9DIR_
			return P9DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP9IN() {
#ifdef P9IN_
			return P9IN_;
#else
			return 0;
#endif
		}


		unsigned int getP9OUT() {
#ifdef P9OUT_
			return P9OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP9REN() {
#ifdef P9REN_
			return P9REN_;
#else
			return 0;
#endif
		}


		unsigned int getP9SEL() {
#ifdef P9SEL_
			return P9SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP10DIR() {
#ifdef P10DIR_
			return P10DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP10IN() {
#ifdef P10IN_
			return P10IN_;
#else
			return 0;
#endif
		}


		unsigned int getP10OUT() {
#ifdef P10OUT_
			return P10OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP10REN() {
#ifdef P10REN_
			return P10REN_;
#else
			return 0;
#endif
		}


		unsigned int getP10SEL() {
#ifdef P10SEL_
			return P10SEL_;
#else
			return 0;
#endif
		}


		unsigned int getPORT1_VECTOR() {
#ifdef PORT1_VECTOR
			return PORT1_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getPORT2_VECTOR() {
#ifdef PORT2_VECTOR
			return PORT2_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getDCOCTL() {
#ifdef DCOCTL_
			return DCOCTL_;
#else
			return 0;
#endif
		}


		unsigned int getBCSCTL1() {
#ifdef BCSCTL1_
			return BCSCTL1_;
#else
			return 0;
#endif
		}


		unsigned int getBCSCTL2() {
#ifdef BCSCTL2_
			return BCSCTL2_;
#else
			return 0;
#endif
		}


		unsigned int getBCSCTL3() {
#ifdef BCSCTL3_
			return BCSCTL3_;
#else
			return 0;
#endif
		}


		unsigned int getTA0R() {
#ifdef TA0R_
			return TA0R_;
#else
			return 0;
#endif
		}


		unsigned int getTA1R() {
#ifdef TA1R_
			return TA1R_;
#else
			return 0;
#endif
		}


		unsigned int getTACCR0() {
#ifdef TACCR0_
			return TACCR0_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CTL() {
#ifdef TA0CTL_
			return TA0CTL_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CTL() {
#ifdef TA1CTL_
			return TA1CTL_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCR0() {
#ifdef TA0CCR0_
			return TA0CCR0_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCR1() {
#ifdef TA0CCR1_
			return TA0CCR1_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCR2() {
#ifdef TA0CCR2_
			return TA0CCR2_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCR3() {
#ifdef TA0CCR3_
			return TA0CCR3_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCR4() {
#ifdef TA0CCR4_
			return TA0CCR4_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCR0() {
#ifdef TA1CCR0_
			return TA1CCR0_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCR1() {
#ifdef TA1CCR1_
			return TA1CCR1_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCR2() {
#ifdef TA1CCR2_
			return TA1CCR2_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCR3() {
#ifdef TA1CCR3_
			return TA1CCR3_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCR4() {
#ifdef TA1CCR4_
			return TA1CCR4_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCTL0() {
#ifdef TA0CCTL0_
			return TA0CCTL0_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCTL1() {
#ifdef TA0CCTL1_
			return TA0CCTL1_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCTL2() {
#ifdef TA0CCTL2_
			return TA0CCTL2_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCTL3() {
#ifdef TA0CCTL3_
			return TA0CCTL3_;
#else
			return 0;
#endif
		}


		unsigned int getTA0CCTL4() {
#ifdef TA0CCTL4_
			return TA0CCTL4_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL0() {
#ifdef TA1CCTL0_
			return TA1CCTL0_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL1() {
#ifdef TA1CCTL1_
			return TA1CCTL1_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL2() {
#ifdef TA1CCTL2_
			return TA1CCTL2_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL3() {
#ifdef TA1CCTL3_
			return TA1CCTL3_;
#else
			return 0;
#endif
		}


		unsigned int getTA1CCTL4() {
#ifdef TA1CCTL4_
			return TA1CCTL4_;
#else
			return 0;
#endif
		}


		unsigned int getTA0IV() {
#ifdef TA0IV_
			return TA0IV_;
#else
			return 0;
#endif
		}


		unsigned int getTA01V() {
#ifdef TA01V_
			return TA01V_;
#else
			return 0;
#endif
		}


		unsigned int getTIMERA0_VECTOR() {
#ifdef TIMERA0_VECTOR
			return TIMERA0_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getTIMERA1_VECTOR() {
#ifdef TIMERA1_VECTOR
			return TIMERA1_VECTOR;
#else
			return 0;
#endif
		}


		double getSRSEL() {
#ifdef SRSEL
			return SRSEL;
#else
			return 0;
#endif
		}


		double getSDCO() {
#ifdef SDCO
			return SDCO;
#else
			return 0;
#endif
		}


		double getDCOZERO() {
#ifdef DCOZERO
			return DCOZERO;
#else
			return 0;
#endif
		}


};

MSP430_VARIANT("msp430x54xx", msp430x54xx);

